demo-output/website/campaign/F7_runs/damBreak_MM_a2p25in_coarse_fixeddt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       3704;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       3720;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       3736;
    }
    atmosphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       3856;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3840;
        startFace       3976;
    }
)

// ************************************************************************* //
